{
    "tags": [
        "anonymous","FMA","edward elric","Roy Mustang","Alphonse Elric","!!!!!!!!!!!!!!!!","riza hawkeye","Ling Yao","Heymans Breda","Vato Falman","Kain Fuery","Jean Havoc","Maria Ross","Olivier Mira Armstrong","NICE !","Sheska","team mustang","fma rp","may the odds be ever in your favor","also tho","(( god bless ))","fullmetal alchemist rp","flexarmstrong","so appreciative",";memes","(( OH SHIT ))","(( :'D ))","(( WHOOPS","body horror mention","blackfiire","(( nice","avadite","amestrianhearts","sorry this took 5ever","muses-of-kira","THIS IS GORGEOUS???","dolcetters","THIS IS SO CUTE THANK YOU","fma rpc","(( !!! ))","aaaaa ))","stonedeafdog","alchemic-elric",";Dash Commentary","must hate dogs","muses of kira","shiryonsheli","( ;dash games )","(( oof ))","inseparabilum","foliateface","warraigoe","me a raving bisexual: /both? both is good/ ))","(( oh??","cerbinwen","(( oh worm? ))","ichoreyed","madame-lulu","encyclopedichead","loyalestdoginthemilitary","Ishvalanfaithful","burningflamesofhell","? ? ? ))","fiuehrer","mangataonegdaj","dap-brown","youngesper",".TECH SUPPORT ( ;kain fuery )","scentedbygunpowder","citrinexdreams","alchemic elric","(( u go six years back into the kain fuery tag and it's still the same shit omg","open to almost anything","7-9 years","i will cry ))","heymans-breda","(( good times ))","gaaaaaay.png","(( and that's a wrap","*to be tagged","carry on lieutenant","(( i hope this is alright ! ))","(( two sides of the same coin ))","*to be tagged.","(( s a d ))","(( aaaayyyy ))","(( I'm in stitches ))","(( FREE THEM ))","*to be retagged","(( tbt ))","(( hope this is alright ! ))","(( I'm dying oh my god ))","(( lmfaoo ))","(( Hope this is okay ! ))","(( adventures in iconing ))","(( rip these two","(( ??? ))","(( WINKEDY WONK ))","(( oh mood.. ))","cheualier","fullmetalscullyy",".BROTHERS IN ARMS ( ;team )",".LUNCH BREAK ( ;ooc )","(( what's up kiddos it's self promo time ))","(( whY is this such a fuery meme tho go bother the kid ))","(( i have no idea what kind of tagging system i plan on using. or post formatting. hmmMMMMmmm shrug","that's a ''figure out later tonight'' kind of problem ))","and pages.... gotta fill out important pages....","(( guuUUH THE TWO BEST BOYS........... ))",". ( ;manga )","(( aaaay 'til i figure out formatting ur stuck w my old one","bisouuux ♥ ))",".( ;memes )",".( ;manga )",".( ;my panels )","(( JSYK THIS WAS FUERY'S INTRO TO THE SERIES LMAO ))",".( ;promos )","(( lumiiiiieeee!!!!!! ))","(( HEY LUMIE I'M GONNA??? SO B ?!?!??!!!!!","OH I AM ALREADY SOBBING IT'S TOO LATE","THIS IS LITERALLY.... THE /CUTEST/ THING I'VE EVER SEEN IN MY ENTIRE LIFE LUMIE I LOVE YOU.......",".SHARPSHOOTER ( ;riza hawkeye )",".DOG OF THE MILITARY ( ;black hayate )","(( AND ON THIS DAY KAIN FUERY MADE A DEEP ERROR IN REFERENCE TO HIS DIGNITY. ))","(( i mean i'm glad i'm SURE that my hd-sharp icons aren't just blurry bc of my eyesight but i'm p annoyed ))","** i think it's the uploader itself... not the post ))","(( THAT SECOND ONE IS 100x100. FR. BUT IN THIS PIC /NEITHER/ OF THEM ARE 100x100 ))","** unless it looks fine to you??? ))","(( JFDIOSJFISDF ))","(( fuery vc: i fucked up i fucked up i fucked up--- ))",".IT WAS MORE OF A HOBBY ( ;interests )",".SMOKING GUN ( ;jean havoc )",";; BROTHERS IN ARMS ( ;team )","(( jfsoidhfoISDFOISDJFIO !!!!!!!!!!!!!! ))",".TOP DOG ( ;roy mustang )","(( IT'S JUST EVERY TIME I MAKE A NEW ICON I GET SO EXCITED I WANNA USE IT................... ))","(( bully him u know u want to ))",".BRAWNS&BRAINS ( ;heymans breda )",".DATA BANK ( ;vato falman )",".STEELY RESOLVE ( ;maria ross )",".SHAMELESS OPTIMISM ( ;denny brosh )","(( aaawh c': ))","(( lmao aaawh ed","he wants a good ghost story and he's about to get waREHOUSE THIRTEEN LMAO","fuery like ''shit...... i'm the pushover uncle.......... SHIT... I NEED TO ENTERTAIN THE KID WHO THREATENS GOD ON THE DAILY...'' ))",";; GEE MA I WANNA GO HOME ( ;crack )","** alternately ed vc: YEAH GIVE ROY UR BEST RIGHT HOOK ))","(( I HAVE BEEN LOOKING FOR THIS IMAGE /EVERYWHERE/ JFAOSJDFOI ))",".STRONGMAN ( ;alex louis armstrong )",".FAMILY MAN ( ;maes hughes )","(( yeyeYYYEEEHAHFHDFHOSIDFJDSF ))",".SILVER SOUL ( ;alphonse elric )","(( AAAAA THAT'S SO SAPPY I HATE THEM SFM.... AAA..... THEY'RE RIDICULOUS ))",".QUARTER METAL ( ;edward elric )","(( THEY're just so fucking dumb i love them so much ))","(( slides u all 520 cens............. ))","(( kill!!! me!!! slowly!!!! i'm relistening to ''Breathe'' from the soundtrack and just","team mustang @ ''i look to my left i look to my right / i see other men who fight the same fight /","and during those few short hours a day / the noise in my head goes away'' ))","roy is donny novitski??",".( ;music )",".( ;ambiance )",".RADIO STATIONS ( ;music )","(( JFOIAJPSDFSDF KINSHIP OVER THEIR LACK OF HEIGHT big mood","fuery vc: teenagers intimidate me / ed vc: i like this man because he's short ))","(( kain crying in the bg: i'M A GOOD NOODLE.... ))","(( mom friend: ACTIVATE ))","(( haha bully him ))",".( ;my art )","(( i'm working on icons and jfoisdjf","he really does get screen time in every media..... i cry.... ))","(( i'll do u one higher:","tol/smol mutual pining","s o f t ... . . .. ))","(( i'm going to S O B","callout post @hiromu arakawa for naming her oc ''dog furry'' and then giving him puppydog eyes while HOLDING A PUPPY ))","(( how did i forget this fjaoisdjfoaisf kaTE i'M DYIN... ))","(( jfaoisdjofdsf ))",".ICE QUEEN ( ;olivier mira armstrong )","dap brown","(( howdy hi ! i hope this is okay ! ))","(( this is obligatory lol ))","( v; || post war. )","(( he protec ! he attac ! but most importantly sir u need to lie on ur bacc ! ))","(( me: give him love!!!!","me yesterday: bully him ))","(( nervous fuery vc: /guys the boss wants to come drinking w us/ but she's cool","HONESTLY i think team mustang would /pay/ to see riza get drunk ))","(( are u kidding i'm gonna reply to all of them","i mean GEE WHIZ isn't colonel mustang SO GOOD to his men","smear it on thick colonel rye mustard ))","(( YEA BOIII ))","(( FUERY LOVES ED. HE ADORES THE ELRIC BROTHERS!!!","ACTUALLY HE'S SUPER ENDEARED THAT ED SEEMS AT EASE AROUND FUERY ENOUGH NOT TO YELL ALL THE TIME","TEAM MUSTANG LOVES THE ELRICS WITH THEIR ENTIRE BEINGS!!!! but fuery has zero idea what to do w them other than PROTECC","fuery vc: he likes me!!!!","fuery vc: i'd lay down my life for this boy!!!!!!!","also fuery vc: oh my god who stuck my 24 y/o ass at the kid's table ))","(( fuery doesn't know SHIT about automail / hydraulics. he can figure out some of it on his own tho","HOWEVER he knows good damn workmanship when he sees it and will appreciate winry's handiwork more than anything","asks ed about his mechanic and her work. /then about winry/. hey ed what DO u think of wiiiIIIinry huuUUUH?","..... we gotta thread this ))","(( LOVS THAT GOOD BOY...... ))","(( drinking songs. passing time around the campfire while traveling. singing during training lol ))","(( MOST OF THE LENGTH OF THIS IS JUST RAMBLING PROSE PLS IGNORE... I'M SO SORRY ABT THE LENGTH Y I KES ))","also hello friend!!!!! ))","(( uguhghghgh i have so much art muse but the art is just not flowing;;; ))","(( me: wow gee i should get to these memes","also me: reblogs. more memes ))","(( been toying w hc's about fuery's roommate and for now i'm just calling him 'victor' ))","(( GAAAAAAAAAYYYYY.png ))","(( my city for team mustang Bandstand AU .............. ))","(( hey anon :'c ))","(( HEY THIS SCENE KILLS ME!!!!!","''I'm gonna SURVIVE this! I'm gonna LIVE! I WON'T DIE FOR THIS!'' HEY I'M DEAD!!!!!!!!!! ))","(( on two fma wikis it rounds him to somewhere in his early twenties which i think makes sense","although i've been looking at average age spans for being a senior NCO as fuery is","and other factors are pointing to him being a little older than we'd thought","the problem is that amestrian military rankings- which are LOOSELY based off of the old prussian military- don't exactly coalesce","and on top of that translating ranks from the english equivalents of japanese military titles leaves a lot lost in translation","i.e. in japanese fuery is referred to as ''fuery-soucho''. which can be translated as ''sgt. major''.","hoWEVER IN THE JAPANESE ARMY A ''SERGEANT MAJOR'' IS APPROX. THE EQUIVALENT OF ''MASTER SERGEANT'' IN THE US","WHICH DOESN'T EXIST IN OLD PRUSSIAN RANKINGS. BUT SGT. MAJOR /DOES/ EXIST. BUT IT'S NOT NECESSARILY THE SAME RANK BC PRUSSIA DOESN'T EXIST","in FMA'verse master sergeant is still one of the lowest NCO ranks-- if not THE lowest ( everywhere else in the world msg. outranks w.o","but not fma )","now in the US army there's no age restriction on becoming a master sergent. h o w e v e r there's a minimum service time of","and so like i guess if u go to a US college-aged military academy for four years u graduate automatically as a 2nd Lt","( and are required 5 active service years + 3 inactive/reserve )","buT HE'S NOT A 2ND LT. SO NIX THAT?","and now IGNORING ALL THAT: EVEN IF HE ENLISTED AT EARLIEST ~17 y/o ( MAYBE 16 B/C IT'S WARTIME PRUSSIA/AMESTRIS ) +8 YEARS ACTIVE SERVICE","which would put him at YOUNGEST ~25-26 y/o.","that said i sorta doubt he enlisted early. and while i think he has the brains + stamina for the academy his rank cancels that out","so where i'm at tbh is probably: enlistment ~19.","(( i've been using scanlations. i need to go find the old manga volumes i own jfosidf","I USED TO HAVE THE 1ST LIGHT NOVEL BUT IT GOT SOLD AT A GARAGE SALE WHEN I WAS LIKE 14 AND NOW YOU CAN'T FIND IT ANYWHERE I'M SO UPSET ))","(( but then back to the translation issue is that japanese schooling is also spread out different lmao;;; the comparison gets funky ))","(( youngest colonel? youngest state alchemist? youngest master sergeant????","riza's a god damn babysitter ))","(( the plot thiccens ))","(( tbt how it's been almost TWENTY YEARS and not a single translator can still agree on how to spell/pronounce ''risembool'' and ''liore''","even the ones in the saME COMPANY !!! ))","(( i can't believe Actual Ritsu loves and supports me and my lad ))","(( well tbh since i was basically just between 23-24 and 26-27 i think i'm just gonna go with 25","until further noted.","i need to get a twitter so i can a) vote on ur thing and b) tweet hiromu arakawa for secret informtion ))","(( IDK he's 24? 25? whatever","spoiler: fuery lied about his age to the government ))","(( FJOSIDJFO ))","(( WHEN I SAY I INTERNALLY COMBUSTED FJAOSIDJGOASIDJF","I'M GONNA SOB THAT IS SO CUTE","I LOVE TWO (2) SWEET BOYS!!!!!!!!!","IOU BETTER LINEART WHEN I FIX MY TABLET ♥♥♥ ))",";ritsu kageyama",".( ;save )",".( ;gifts )","(( i'm cRYing jfosidjf ))","** I COULDN'T TELL IF THIS WAS FROM A MEME OR NOT. EITHER WAY IT'D BE THE SAME ANSWER? SORRY IF I DISCREDITED A MEME","UR MAN IS CUTE AND WELCOME ANYTIME REGARDLESS ))","(( get these kids some ASPIRIN... ))",".GOLDEN PRINCE ( ;ling yao )","(( AHAHA R O Y","fuery vc: jfaFJSIODfjosdf s-sir//;;;;;; ))","(( good guy weird boss ))","(( o m g poor breda HAHA","''it's a really good book about a guy and this dog--'' ''/you don't say/'' ))","(( her!!!!! it's her!!!!!!! ))","(( I KNOW IT'S NOT EXACTLY THIS BUT THIS IS WHAT I THOUGHT OF JFOSDIFJ ))","(( I CAVED AND USED UP A PAGE IN THE SKETCHBOOK............ I HAD TO........ ))","(( off to the library rn will bbl to do replies ! ))","(( i'll do these between tonight and tomorrow when i'm traveling ))","** i'll take multiple requests from same person and stretch 'em out thru tomorrow","feel free to send more than one message ))","(( an absolute LADMAN... ))",".( ;headcanons )","(( anyways i'm Emo ))","(( he's the DUMBEST SMART GUY YOU KNOW i'm oh so sorry ))",";; SEVEN DEADLY SINS ( ;homunculi )","(( i've got a plane ride........ i hate planes...................","i'll doodle to distract myself mostly hhhhhnnnnhg ))","(( LATER GATORS ))",";; BROTHERS IN ARMS ( ;team mustang )",".IT GREW OUT OF A HOBBY ( ;interests )",".( ;ambiance )",".JUST A MAN AND HIS DOG ( ;about )","(( ME CRYING IN THE BG ))","(( KILL HIM RIRI ))",".( ;fics )","(( jfiosdjfsd ))","(( I'M STILL OUT OF TOWN BUT HAD TO REPLY? ))","(( might revisit / touch up this hc when it's not 3 AM / i'm more coherent","but had to get down these thoughts before i forgot 'em","kain picks up language pretty quickly but it's not really an ''area of expertise''.","either way tho it makes him VALUABLE in his field- something mustang no doubt noted before hunting him down.","HE'S NO PRODIGY HE'S JUST A NERD WITH A PASSION ))","(( pfhsf ))","(( YOU'RE TELLING ME THAT THE LITTLE HIDEY HOLE HE USED TO DEFEND RIZA FROM GLUTTONY","AND THE RADIO SHACK OF FUERY'S THAT ROY AND RIZA ARE ABOUT TO USE TO MESS WITH THE MILITARY'S RADIO WAVES","IS SOME FUCKIN CITY CONDO RESIDENCE OUTSIDE OF HIS MILITARY DORMITORY","IT'S NO WONDER HE'S SO FUCKING BROKE???!!!","okay but so i'm thinking","i can't remember how falman got that safehouse with barry-- were these funded by roy???","are they just military safehouses??????","or was roy like ''hey we have an emergency. go rent another apartment i'll pay you back eventually''","oh my gosh jfsoidf. FUERY'S SPARE RESIDENCE HAS ALL THOSE ANTENNAS SITTING OUTSIDE THE WINDOWS AND /SO MANY RADIOS/","and that barebones closet with like three coats two spare pairs of glasses a bunch of guns lists and pill bottles","oh man. i'll dig into this deeper when i get home later. ))","(( I'M HOME I LIVED BITCH","gonna get to other memes tomorrow just wanna do these til i fall asleep ))",".POWERHOUSE ( ;rebecca catalina )","(( y'know what the hell it's bar night with the boys !!! ))","(( SJDOFISJDFOISDJF ))","(( I GOT THE ASSISTANT DIRECTING JOB I'D BEEN WAITING TO HEAR ON !!!!! ♥","I'VE BEEN WICKED DISTRACTED + OUT OF TOWN THOUGH AND I'LL BE CRACKING DOWN TOMORROW ))","(( ''... in the way THIS time'' /omg emil/ ))","(( JFOISDJFIOS ))",".( ;video )",".IT WAS MORE OF A HOBBY ( ;about )",".MISS MOTOR OIL ( ;winry rockbell )","armordsoul",".THOSE CAISSONS GO ROLLING ALONG ( ;army songs )","(( KJIOSDGJ ))","(( L M A O........ LOOK AT HIM........ ))","(( ''hit him with a phone booth'' i'M FJSODIFJOISDF","I LOVE A MAN.......... THIS MAN.........","THANK U FOR UR WISDOM MAJOR ARMSTRONG ))","(( hi hi !  i hope this is alright?","if i've misunderstood your dossier at all please do correct me; i'm excited to write w you ♥ ))","(( MMMMMM ♥ ))","(( SHE ALWAYS GOES FOR MY GOOD BOYS LMAOOO ♥♥♥","SORRY THIS TOOK EONS ))",".INNOVATION & INGENUITY ( ;aesthetic )","(( he /really do be that dumb sometimes/ !!!","havoc and fuery's drinking shenanigans get progressively gayer and kain's like ''well huh guess he's really just not thinking straight.''","UH U RIGHT ABOUT THAT KAIN... ))","(( this is STUPID CUTE JFOISDJfisodf ))","(( heading out for a few hours ! will reply later ! ))",".LET'S MINGLE ( ;romantic suggestions )","(( tagging u bc ilu ♥ ))",".THE AVARICIOUS ( ;greed )",".CAUTION EXPLOSIVES ( ;zolf kimblee )",".MAMA BEAR ( ;izumi curtis )","(( also.... i literally can't believe there's no ship art of these two... ?? one of my top fuery ships?","but alas. for another time.","i really like the idea that they stay friends. catch up when everything settles. touch base here and there. ))","(( that sounds about right for kain aawh ♥ ))","(( kain on a monday or kain with a hangover","give him some S P A C E ))","FALMAN DESERVES BETTER 2K19 ))",". SMOKING GUN ( ;jean havoc )","(( BREDAAAA","HAHAHAAA. ))","(( AAAAA RITSU I'M !!!!! ♥","also i've been meaning to update my verses page-- i have a modern verse that's super versatile","/yeets fuery into seasoning city ))","( it REALLY ISN'T DIFFICULT jussayin )","(( FLUSTERED FO SHO AAAY ))","(( STOP THIS IS CUTE JFOIASJDF ))","(( JFOISDJFO I FEEL BAD I WAS DISTRACTED OUT ICONING AND MISSED SOME SERIOUS DISCUSSION but know that","i'm really proud to come back and see communication happening !!!","this is healthy rpc stuff. nice. ty guys ♥ ))","(( huEHUHEU HE U HEUHEUUE ))","(( for the rest of tonight i'm replying to THESE memes and doing STARTERS just as a heads up ))","(( there you go ! ♥ ))","(( gosh whoever u are ur very astute","i had the icon up for like 5 seconds fjsoidf ))","(( HOW DID I MISS THIS JFOISDJFOISDJF OMGG","also lol ''badass surnames and then.... /kain/'' ))",".MISS LIBRARIAN ( ;sheska )","(( BWAAAAHGOHGOISFJIOJF ))","(( JFISODJFIOSDF ))","(( gah i told myself i was going to get to anime iconing this week","but i also told myself i'd get to drafts","and i'm motivated NOW for writing... lmao..... anime icons eventually orz ))","(( headed out to work; selectively accepting these","will be back late afternoon to do these + a couple replies + pASS OUT AFTER WORK ))",".( ;self promo )","at work til evening but ayo here it is ))",".DATA BANK ( ;vato falman ) .TECH SUPPORT ( ;kain fuery )","(( im drinking a lil too lol and doing these + threads tonight","i haven't written drunk fuery yet ))","(( DRUNK LMFAOO ))","(( OMG?!??!?!!!!","(( /THOMAS/ !!!!!!!","I'M VIBRatINngG ))","(( what's up u rat bastard ))","GORE || ;for t.s","BODY HORROR || ;for t.s","(( ME CRYING ABOUT KAIN AND THOMAS AS DRINKING BUDDIES IN FOTSET ))","TRAUMA || ;for t.s","(( i just inverted the colors bc jfoisdjfosdf. just because i could ))","(( I HAVE A LOT OF THOUGHTS ABOUT KAIN FUERY AND SOMETIMES NEED TO WRITE THEM OUT BEFORE ANY REPLIES ARE EVEN CONCEIVED..... ))","** i've been reading up on one topic for almost 48 hours to be able to hc it out hhh ))","(( I'M SORRY THIS ISN'T INTERESTING TO ANYONE BUT ME","I HAD NINETEEN TABS UP AT THE SAME TIME TO WRITE THESE HEADCANONS I WANNA STRIVE FOR ACCURACY LIKE ARAKAWA-SENSEI BEFORE ME ))","(( i am in LOVE with this fanart?!?!?!?! ))","(( CATCH ME ABSOLUTELY SCREECHING WITH JOY @ RED !!!!!!!!!!!!!!!!!!! ♥♥♥ ))","(( 'SORRY COLONEL JUST TESTING THE MICS' ))","(( AHAHAHA BYE KAIN ))","(( C U T E A S H E C K ! ))","lieutenantandherdog",".A SUNNY DISPOSITION ( ;motivational )","(( hey there ! hope this is alright ! ))","(( re-reblogging bc i'll be doing a few today ))","(( JFOISJDF C U T E AAAWWH","/HE HAD TO SAY SOMETHING IT WASN'T FAIR/","PROBABLY BITING HIS TONGUE THE WHOLE WHILE and then the minute hakuro leaves","under his breath: ''whatta piece of /work/'' ))","(( A REPLY IS FRESH IN MY MIND SO HERE I GO ))","(( did i write an entire book for u? oops ))","(( fpfshfspshfsf ))","(( LOOKIN GOOD BOYS ))","BREDAAAA HAHAAA ))","(( AAAGH the tumblr-ask-issue has struck this blog","and i can't format it w small text anymore ))","(( I'M CRACKING UP JFOSIDJFO THEY'RE SO STUPID ))","(( heading out for a while but be back for replies and starters ✌️ ))","(( FIRE UR GRAPHIC DESIGNER TUMBLR WTF THE FUCK. ))","(( ** i'm assuming this meant ''crushes'' but if it means smth else lmk ))","(( shootin' the breeze \\o/ ))","(( I CAN NOT BELIEVE THIS OH MY GOD JFOSDJFOISDF ))","(( i knew it......... ))","(( i'll be on later tonight w some icons though ))","(( fuery at any of his superiors jfsoidfj ))","(( GHSFHOISDFJO SHSHShshshsshOIS AWHH ))","(( this is so cute i'm gonna cRY JFOSIDJFOISDF ))","(( kain's good at FUSSING ))","(( i've never written a eulogy before. i really am struggling","i have less than twelve hours to capture the essence of my zayde in a single spoken word when all the words in the english language wouldn't","even come close to enough ))","(( KISS FOR KISS KARMA. SPECIFY WHERE PLS ))","(( THIS IS BASICALLY JUST THE REVERSE MEME they might not all be on lips jsyk !!!! ))","(( it's sexy sunday for a few more hours.","i have a few other affectionate memes i need to reply to also","and it's otherwise a lil difficult to get that outta fuery sober lmao;","NO NONCON none of that shit. only drunken regrets from an overly affectionate sergeant. one time offer. ))","(( jfsiojfoiDSJFO GET IT FUERY? ))","(( XNFDKTDKRY ))","(( be gentle with him roy boy ))","(( OH HELLS TO THE /YES/ UGH WORK IT KIDS ))","somebody's quite the artist !",".( ;wall commentary )","(( GIVE RIRI SOME LOVE 2K19 ! ))","(( if i may quietly add.... flashbacks can come with bodily exhaustion too.","it isn't uncommon for the sufferer to feel logged down and bone weary even after a minor episode","olefactory ( scent ) hallucinations are a thing too. ))","(( SO WHO'S GONNA OWN UP AND WRITE HUGHES AND/OR SHESKA WITH ME HUH ))","(( jfsiodjfo i am so sorry this is like 60% unimportant prose ))","(( FLHLHFLYD I LOVE THEM THEY'RE SO DUMB... ))","(( I SWEAR SOMEBODY GIFFED IT HERE ))","(( LOL YES THERE IT IS THAT SCENE JFSODFJOISDF ))",".CHESTY LARUE ( ;lust )","(( LMAO U GUYS.... ))","(( a crapshoot for headcanon vs. angst","[ send it twice for one of each ] ))","(( DKGDKGDKGDKGD ))","(( off to work but wanna try making new icons tonight so ))","(( WOW amazing ! ))","(( oh snazzy boys ))","(( something i love is the care to detail everything is given-- i.e. their stars and stripes","breda n havoc are both officers and therefore have the 3 stripes + a pin and star","fuery is still an enlisted and only has one stripes + a pin and 3 stars-- one of the senior enlisteds but not yet an officer","and like i'm always blown away at FMA's attention to detail but EVERY TIME I THINK ABOUT HAVING TO ANIMATED THE STARS AND STRIPES...","AND ALSO GET THEM ALL /RIGHT/ PER CHARACTER..... ))","(( i don't mind doing iconless threads either jfsoidfjo i do it all the time off-tumblr","i just like the look of consistent presentation lol. BUT I MEAN IF ANYONE WANTS TO WRITE... W/O ICONS WHLE I DON'T HAVE ACCESS TO ICONING...","................. hmu ))","(( at least i can do small text again but at what fucking cost ))","(( i love answering opinion questions","but i always hate ship questions bc i don't wanna give the wrong idea abt muses i write with","bc i /don't/ automatically ship our chars","sometimes it's more like ''oh. i could see them being cute.'' or ''oh. i could see a situation where one is attracted to the other''.","anyways.. ))","(( JFOIASJDFOIASJFOAISJODIFAOISF ))","(( ok are they in a restaurant in the first panels tho ))",".SILVER SOUL ( ; alphonse elric )","(( GJFHVDUGU ))","(( this new laptop and i are having Issues and i may need to bring it back ))","(( DAMN I NEED A BARRY TAG JGLUTJHGJ ))",";;BROTHERS IN ARMS ( ;team )","(( IN AN HOUR IM SWAPPING MY LAPTOP AT BEST BUY FOR THE THIRD TIME THIS MONTH","GOING BACK TO THE BRAND THAT'S TREATED ME RIGHT FOR SO LONG...","DOES ANYONE HAVE BOOTLEG CS5 PLS PLS.... ))","(( tbt that time they kidnapped the fuhrer's wife ))","(( i just love these sketches jfaoidjfoaisdfjaof ))","(( FJOSIDFOISJDF ))","(( /ALSO I STILL NEED A BOOTLEG CS5 HELP A BITCH OUT/ ))","(( geddit it's cuz they're both pUPP I E s ))","(( WE. STAN. ))","(( the overlap is Me and OP you are c o r r e c t ))","(( WOW a late reply but ghaoifosdf i'd had plot ideas for this one since i'd sent it amg ))","(( THIS IS LATE BUT HI LUMIE HI !!!! ))","(( they seem like they'd be surprisingly good conversation if they can find shared interests/topics to talk about","and not like i'm always on my ''war trauma'' bullshit but i like the idea that they can swap war stories. casually.","post-ishval and post-aerugo i feel there's now a link of shared experience. and not that roy didn't take fuery seriously before","but there's a new and mutual understanding of one another. common ground where experience outranks title. ))",";; DESPITE IT ALL WE SURVIVE. ( ;southern border war )",";; BEL PAESE. ( ;aerugo )","(( aawh falman tho ))","(( in his FIRST appearance","kain vc: shut up roy ))","(( WHAT KINDA GHIBLI ASS LOOKIN MF........","adventures in iconing w shark ))","(( jfsoijdfo oh hon ))","(( heyo !","i wasn't sure which greed form / verse you were going for but i figured one that looks like ling offered two possible outcomes lol","my timeline is flexible so be it pre- or post-Promised Day. whichever works for ur Greed ? ))",";; BEL PAESE ( ;aerugo )","(( hope this is okay ! ♥ ))","(( jfsodihfisd ))","(( STILL LOV THEM......... ))","(( doing replies in and out tonight so feel free to ask me hc stuff ! ))","(( i completely ripped this idea off of M*A*S*H not even gonna lie lol","but also bc of all the english mistranslations / misspellings of karley's name in FMA translated as ''curly''","i thought that'd be a fun way to work it in haha ))","(( i'd call him ''fit enough'' but don't even bother comparing him to havoc or ed lmao ))","(( not a completely unmanageable one per se","fuery LOVED fireworks as a kid. they've always fascinated him; always wondered how they work / are made","but the rib-rattling sounds and flashing blinding lights and popping bursts of explosions ringing in his ears and gunpowder on the air","if he can prepare for it? be inside? knows what time they're coming at? he can manage!","but even at that and otherwise Bad Things can/will still ensue ))","(( i know it's crackhead hours rn but i'm jussayin??","riza hangs onto that jacket the rest of the series lmao","meanwhile i know the former is '03 but like?? they really went hard w those disguises fam. riza's turtleneck?? y'all???? ))","(( CATCH ME INCOHERENTLY SOBBING ABT PRINCE OF THE DAWN JFSOIDFOISFD ))",".WRATHFUL RULE ( ;king bradley )","(( bye fuery ))","(( i will leave it to ur personal hc or FMAverse canon religions","i think if kain was religious it would be due to upbringing but doesn't exactly subscribe to a particular belief ))","(( oh damn??","also i italicized things he KNOWS how to do but doesn't do /well/ ))",".( ;dash commentary )","colonel don't heckle the elrics","(( it's his casual talent: tongue numb to spice","fuery would do the ghost pepper challenge if asked i bet ))","(( kain's learned better than to tattle on roy ))","(( i mean... i guess roy and ed exchanging jabs is p old hat... ))","(( fuery and roy just hissing back n forth under their breath / when riza's head is turned is. On-brand ))","(( lmao tbt ))","(( two hot and valid takes that will both continue to coexist eternally ))","(( whSAShsSHHKSHOULJDI","/aw colonel/ jfsoijfsidf ))","(( ? ))","(( aaaah ! well hello there !","and ditto back at you i'm so excited fjosijfsodf ))","awphowonse","(( ACTIVELY FIGHTING THE TEACHER. RUNNING HUMAN TRANSMUTATION THEORIES BY EACHOTHER IN THE MIDDLE OF CLASS. FALLING ASLEEP.","SASSING THIS POOR LONG SUFFERING TEACHER........ love em ))","(( and in my tedtalk i will...... ))","(( THIS IS THE BEST THING OMG?????","SHE TAKES EM OUT ONE BY ONE.......... YES RIZA YEEEES.............. ))","(( i'm aboutta get to replies but jfsoidjfosdf ))","(( i guess it be like that sometimes","sb pls write that team mustang fic.................... ))","(( bwaaAAAAAH i love thiiiis i love these twooo ?? ))",".( ;motivational )","(( flipping through my headcanons tag and fuck im emotional","i need to update it soon ))","(( can u believe roy is surrounded by two of his biggest mother hens ( excluding armstrong )?","riza and kain hanging off of either of his arms: /please let us take u to the doctor colonel/ ))","(( arakawa's narration: ''AFTER THE YEAR ENDS... AND THE NEW SEASON BRINGS THE PROMISED DAY...''","me pointing to the singular fuery panel in the entire chapter at the bottom left corner: sob emoji ))","(( more adventures in iconing at 11 ))","(( i'M FUCKIGNOIGOI SHSRIKEING I'M DONE ))",".BAD BUTCHER ( ;barry the chopper )","(( fuery @ roy ))","(( i literally completely forgot about how roy met those guys and the aerugo/ishval thing oh man ))","(( heading out to run some errands and then go to work; these'll be answered later tonight ))","(( will reply when i get home later tonight ! ))","(( anything i've reblogged today is totally fair game !!!!!","i'm in a writey mood today i wanna get to some thread replies later !!!! ))","(( might only do a few bc not here for too long but","msg me w a suggestion if ur uncomfortable replying to this post w it ))","(( hi so uuuuuh did u say ''an entire thread of kain fuery playing with his favorite dog'' ))","(( aaawh sheska. RIP fuery. ))","(( i like to think that the best time to catch kain rambling is when he's working jfosidjfo ))","(( kaIN IS SUCH A WEIRDO BUT HE'S A GOOD KID..............","..... or perhaps a SNEAKY kid.............","ask him just /who/ owes him favors some time","(( off to work rn bbl ))","(( bi vibin? bi vibin. ))","i'm probably away rn gonna be gone most of the day but","/oh/??? ))","(( IDK THERE'S REALLY NOT MUCH TO IT i just wanted to reply :') we love roy mustang in this household !!!!!!!!!!!!!!!!!!!! ))","(( pfShk","im still at work but just Imagine...... ))","(( i can't believe kain is gonna break his hand hitting armstrong's abs ))","(( IM' FUCKGINOFGFJOSD HAHAHAA............","stupid boys jfosijfsfido ))","(( hi i'm Sad what's your name ))",".( ;answered )","(( me and my friend rewatching this ED earlier: ''THEY'RE BUYING THEIR MOM!!!!!!!!!!!!!!!!!!!'' ))","(( JFOSDJFI ))",".( ;to draw )","(( if char not specified i'll just draw fuery fjosidf ))","(( can you believe these two snots gonna strongarm fuery into a panic attack ))","(( cheerful-lookin' olivier felt really unnatural so.............. i just projected Gay Feelings and let her catch Izumi smilin....... ))","(( it is 3:30 in the AM and i'm so tired BUT I BARELY GET THIS LONG CONSECUTIVELY TO DRAW ANYMORE......... I'M THRILLED ♥","and i'm excited to get to some of these memes tmo !!!!!!! ))","(( ooooo !","will get to these tomorrow too !!! ))","(( JUSTICE FOR FALMAN 2020 ))","(( I AM CRACKING UP AT MY DESK RIGHT NOW JFOAISDAGOIH /I'M AT WORK/ IM DYING IN PUBLIC THIS IS SO BAD ))","(( /HALAKINISHIO ART/?!?!?!?!?!?!?!?!","I WENT NINE YEARS BACK IN THE FUERY TAG AND I FOUND /HALAKINISHIO'S OLD ART/?!?!?!?!?!??!?!!!!!!! !!!!!!!!!!! ))","(( OH??!?!? MY GOD?!?!??! NISHIO'S ART!!!!!!!!!!!!!!!!!!!! ))","(( OH MY GOD NISHIO !!!!!!!!!!!!","THIS ARTIST VANISHED OFF THE FACE OF THE INTERNET LIKE 7 YEARS AGO","ALONG WITH ALMOST ALL OF THEIR TEAM MUSTANG ART ON LITERALLY /EVERY ART MEDIUM/ AT THE TIME","FROM THEIR PERSONAL WEBSITE TO PIXIV TO TEGAKI.E TO DEVIANTART. JUST UP AND VANISHED","( the tegaki- not tegaki.e- page is still up but it's mostly havoc and fuery not the team )","BUT !!!!!!!!!!!!! ))","(( i think i was a roleplayer at one point not just a doodler jfoisdfoisf ))",".( ;open )","(( they're SO DUMB.... ))","(( IT WAS A $500 PROJECT.........................","I WAS SUPPOSED TO MAKE................. $500.................","AND IF SHE PAYS IT TOMORROW WHAT AM I FUCKING MAKING????","/$150/ !!!!!!!!!!!!","I GAVE HER MY RATES IN ADVANCE I GAVE HER AN ESTIMATED INVOICE","THANKFULLY IT MEANS I DON'T HAVE TO PULL AN ACTUAL ALL-NIGHTER","BUT I STILL GOTTA FINISH WHAT I STARTED TMO","I'LL GIVE HER THE TEN HOURS OF WORK SHE PAID FOR NO MORE NO LESS. FUCKING. FUCK YOU CYNDI.","''ooOOOooohh only $72 for each of THESE hinkley wall sconces!!!!'' CONGRATULATIONS CYNDI UR PAYING ME TWO WALL SCONCES !!!!!!!!!!!!!!!!!","/FUCK U CYNDI/.............. ))","(( :') awhhh ))","(( i speak several languages and now that i'm taking a World Languages class for funsies i NEED AN OUTLET ))","(( jfoidJOIFJSOIDFJOSIDFJOI","OH GOD HEY WOW...... THIS PUNCHED RIGHT IN THE GUT I WASN'T EX.P.....ECTING THAT.................... OH NO... OH BREDA...... ))","(( bljgwhhgfjfh sure ))","(( maybe someday i'll have my life together !!! ))","(( i am so proud of him.... My heart... ))","(( ooOOOOOoooooo a nice long list ))","(( kain is worth $52 oo damn ))",".( :memes )","(( I HAVE CARVED OUT RELAXATION-AND-ROLEPLAY TIME..... A LIL R&R........... ))","(( jfosijdfaoishdfoaisdf N I C E AAAAAAAA RIP BREDA","and also yEAH i feel you there....... i haven't played chess in a HOT second oof lol ))","(( piett vc It's an older promo but it checks out....................... ))","(( FKHLYKHR ))","(( CHOCO'S SHOP IS UP CHOCO'S SHOP IS UP","I JUST GOT BREDA AND FALMAN ))","(( haha rip fuery ))","(( fuckit it's sinday au time fam go wild","maybe he'll even kiss em back ✌️ ))","(( I'll probably reblog this again towards Valentine's day lol ))","(( final weekend starts tonight yeeeeehawwwwww ))","(( ♥♥♥ ))","reigningsniper","( v; || the chess board. )","(( daaaawwwhhhh ))","( v; || geek squad. )","theburiedbookworm","indomitableicequeen","(( oh my Goshhhh ))","(( come collect ur memes !!! ))","Anonymous","(( best buy employee!fuery modernverse au ))","(( aw hell Yeah son ))","(( LMAOOO NIX THE OTHER QUESTION-ASKING MEME I'LL DO THAT ONE ANOTHER DAY","HIT FUERY UP FOR SOME LIES??? GOOD ONES BAD ONES SARCASTIC ONES YOU NAME IT LMFAO ))","(( fuery who wants nothing more than a small animal he can take care of: ''yeah..... i bet they're just.... difficult huh.... ye a h.. '' ))","(( fuery said ''get Fukt colonel mustang'' ))","(( tonight is first seder so i'll try n be on afterwards ! ))","(( aw hell YEAH MAN I ALREADY BOUGHT TEAM MUSTANG SO FIGURED I'D SHOOT FOR A COUPLE RANDOMIZED CHARMS FOR FUNSIES","I LOVE THESE SO MUUUUCH AAAAAAAAAAAAAA ♥♥♥ ))","(( aw hell YEAH MAN I ALREADY BOUGHT THE TEAM MUSTANG BOYS SO FIGURED I'D SHOOT FOR A COUPLE RANDOMIZED CHARMS FOR FUNSIES","(( aawh ))","(( i love this bc it's canon ))","hariolor","( v; || tbd. )","(( aaaaw ))","kain fuery","(( don't toUCH ME don't TALK TO ME he just hitches himself from fotset to central at the drop of a hat bc that's his DUTY TO HIS FRIENDS","and in the manga again like he literally didn't even have time to change??? he and breda are ''deserters''????? they were both at their res*","*respective fronts- west and south???????? unconfirmed canon but fuery and breda literally went MIA ))","(( I'M SLAIN............. I'M WEAK........ ))","(( i rp him somewhere between 25-27 depending on verse/timeline.","for during-series it tends to be 25-ish. promised day and up is 26+ ))","ithinkiknowenoughofhate","(( RIP breda omg ))","(( i have more extensive hc's but since no background was ever given for the char... it really is just all purely headcanon ))","(( oh my glory this is hilarious ))","(( fuery has never been Hip With The Kids sorry anon ))","roy mustang","jean havoc","vato falman","fma","(( huehuEHuehUEHUEe ))","(( aaaAAaaaAA AA AA A aaa AAAAA LETTERS TO SOUTH HQ OR TO FOTSET....... LETTERS TO THE FRONT........... AAAAA........... ))","(( jfsoijdf still doin these","will get back to thread / other memes tonight ))","(( i wonder which ones are the lies ! ))","(( i'd planned on making a new promo tonight but hhghgsgh we'll see ))","it's bi-mlm/wlw solidarity","( v; || c r a c k. )","soldierunderfire","LMFAO..... rip these two....","or more realistically RIP fuery's wallet","oh good so is fuery's broke ass","this is a WIN/WIN/WIN situation","(( IT'S NOT FUNNY IT'S SO FUNNY AHGO;FIAJDOIG ))",".( ;adventures in iconing )","meanttogivelife","(( WINRYYYYYY ♥ ))","(( WINRYYYYY ♥","ALSO feel free to ignore the length of this reply it's just exposition and prose i got carried away fjsoidf ))","(( RIP breda","been there done that lmao ))","(( is it Bully Kain O'Clock again already?","yeehaw maria ✌️✌️✌️ ))","(( aaaaAAAAND ACTION ))","(( working on a presentation for tmo; if i don't get to these tonight i will defs do them tomorrow ! ))","(( omg hahaaa ))","(( i.... tttthhhink? this ask was referencing that answer??? lmaoo ))","(( oo i never do munday stuff ))","(( YOU GUYS ARE SO SWEET..... I'M READING THE MUNDAY MEMES AND TEARING UP........ ♥♥♥ ))","(( b e a utiful ))","(( so much for my lovely productive evening ))","(( cATcH mE bLUShiN IN thE cLuB fjODJFOisjfosd","thank you anon !!!! ♥ i'm glad to be back ! ))","(( U CAN'T SEE BUT I'M BEAMING......... /AWH/............ ♥♥♥♥♥ ))","(( ? ))","(( my brain imploding on itself @ compliments jfaosidjfoasidfa;sdf ))","(( i like throwing this meme out late at night","get me into those heart to heart vibes ))","(( get ready for RAMBLING.................. ))","(( i reread the Warehouse 13 chapter in the light novel bc it happened WAY DIFFERENTLY than it did in the anime","''same story different versions and All Are True''","BUT NOTHING WILL EVER BE FUNNIER THAN THE ANIME IDIOT SQUAD SCARING EACHOTHER W GHOST STORIES","''you see? you were all just scared in the dark. there was no 13th warehouse.'' ''well then what about the ghosts?''","''oh wow now that there's no ghosts i can finally go back to takinig my normal route home.'' ''and we're all happy for you. can i go now''","I MEAN THE REST OF THE EPISODE IS HILARIOUS AS WELL I JUST LOVE WAREHOUSE 13 IT'S SO /FUCKING/ DUMB","the mustang stakeout diary is also different from the original text too holy shit i had a translation floating around somehwere","where i guess all of team mustang started complaining in the ''Mustang Stake-Out Log'' and they turned into assholes","and then it turns out that fuery had been enlisted to observe /havoc/. by /ROY/.","and fuery's a little fuckin Fink. ))","(( team mustang has Chronic Smooth Brain ))","(( I FORGOT ABOUT THESE DOODLES AND THEY STILL MAKE ME LAUGH ))","(( it's ALWAYS Bully Fuery Hour at HQ lmfao ))","(( me.... @ my poor followers......","..... hi guys.................. ))","(( in big depression un-mood need to live vicariously through muse ))","--- ofc then the rest of the scene every time you see him he's wearing a shirt that's not only not tucked in but is also like","3 sizes too big for him ( i wonder if it's one of roy's or breda's lmao ) which makes him continue to look Liddle by comparison","TBT THAT TIME RIZA AND ROY BROKE INTO FUERY'S SAFEHOUSE TO USE HIS RADIOS TO CONTACT ALL THE HEAD OFFICERS AND WERE ONLY ABLE TO DO THAT BEC","*BECAUSE HE HAD WRITTEN HIDDEN LISTS OF ALL THE SENIOR OFFICERS' IDENTIFICATION CODES","tee hee hee look at him go..... up up up............","my city for kain idolizing and respecting roy almost above all others is only matched for my kingdom of roy adm*","*admiring and respecting kain beyond words","roy is an esteemed veteran senior state alchemist youngest colonel of all time","feared and respected by junior officers; despised and envied by senior officers; known for his deadly talents and war heroics","with ambitions to rise to fuhrer and fix this country from the inside out","and he plucks this mousy IT guy for his team who comes into work soaking wet holding a puppy he rescued from the rain","and knows in his heart of hearts that /this kid/ will help him make the world a better place","I'M.... EMOTIONAL","flyinbanachab","(( hm... ))","cromwellharvests","EVERYONE TALKIN ABT KAIN MAKES ME HAPPY.","KAIN? HM.... NOT AS MUCH LMAO","(( awhh ))","(( INSERT FIFTEEN SOB EMOJIS IN A ROW I'M SO HAPPY","lust and hughes + the reigen and teru keychains were randomized and i could not be more thrilled jfaoisdhgaoidjfas ♥♥♥ ))","(( fuery @ fuery: ''does this thing have an off button'' ))","(( GOD UR SO RIGHT................................ ))","(( DEADASS WHAT CHAPTER WAS THIS.... I DON'T REMEMBER....... !!!!! ))","** IS THIS AN EDIT?????? ))","✌️ ✌️ ✌️","(( s o f t. ))","(( as per last time i just like reblogging this late nights ))","(( falman.... is so Good.................. ))","** also omg roy's face in the bg tho ))","(( mood ))","(( REBLOGGING BOTH FOR RP MEMES AND FOR DRAWING PROMPTS","THAT I MAY OR MAY NOT USE AFTER MY MEETING","WINK WONK ))","(( LOUDLY GASPS","/I'M LIVING/. I AM THRIVING I'M LIVING FOR THIS ))","(( most of these'll likely be post-PD ))","(( HI I KNOW I JUST WROTE YOU A STARTER BUT THAT RESPONSE WAS SO... F... UCKING ADORABLE...... ))","(( an important understanding about team mustang is","would die for roy mustang","but also would laugh if he died in a gutter","''haha..... typical colonel'' ))","(( GIVE ME TEAM MUSTANG EMOTIONS OR GIVE ME DEATH !!!!!","THIS IS A TEAM WHO GROWS TOGETHER... A LONG SLOWLY BUILDING BOND THAT MORPHS FROM COWORKERS TO FRIENDS","TO F A M I L Y ..............","THEY LOVE AND CARE FOR ONE ANOTHER AS BEST THEY CAN. THEIR TEAM BECOMES A JOY TO BE A PART OF ))","(( ATTABOY I'M PROUDA YOU LAD ))","(( lookit falman's lil hair wispy ))","(( woo ! ))","(( we stan !!!!!!!!!!!!!! ))","(( once i fix my scanner i'm gonna scan the light novel pages but the first team mustang chapter in Land of the Sand","describes fuery as having a ''teenage-looking appearance emphasized by his small stature''","and then when 03 came out.................. and made him Team Babey-- which will never not be adorable lol-- it really set a tone and m","*made it hard to take the character seriously","and while i am ALL for fuery being a comic relief character and ALL for him being the ''everyman''-least-soldier-ish of the team","i also can't help seeking out these little details of the char as an individual","yeah he's a sensitive care with a sense of inferiority among the ranks but he isn't an outright wuss character??","literally every appearance he has in the manga/brotherhood is him being extremely useful or making observations that reflect the audience","i really think he is the ''everyman''-character that the audience /should/ be able to relate to.","he isn't the big-buff-soldier type and that's okay. he's kindhearted and gentle and that's okay too ! ))","(( did u know kain fuery would /die/ for riza hawkeye?","fuery babytalking @ black hayate: y'know who i'd die for boy? /ur mommy/! yes i would! i would die for her! ))","heymans breda","(( F R E S H ! ))","(( I'M LOSING MY MINDOINNDFJ ))","(( pfhsfhsohfosihdf the end ))","(( this lockdown is hell but thank god i don't have to sit through another goddamn commencement ffs","finals week. i'm Dyin scoob.","THERE ARE A MESS OF MEMES I'M REALLY PSYCHED TO REPLY TO IN MY INBOX. I'LL PROBABLY REBLOG ANOTHER ASK MEME","but aaaghghghghg this week's gonna be gross ))","(( AJOISDJFOISJDOFISDJF.................. CRIES SOFTLY...................... SHE'S SOFT I'M SOFT............. ))","royai","hyuroi","rizalivier","beccain","sheskain","havuery","lingfan","(( FINAL finals woof","if u see replies from me in the next three days","it's bc I'm procrastinating on braining myself ))","(( fuery @ literally anyone on his team ever !!!! ))","(( this is fuery @ hayate when riza isn't lookin ))","(( MY WRIST IS CRAMPING FROM HOW MUCH LINEART I'M DRAWING THRU TODAY U GHH............. ))","(( man as a teen roy mustang seemed like the ideal attractive lionhearted badass with undying devotion for The One True Soulmate","and that was such an attractive thought too","and now fifteen years later the brooding and irresponsibility just would not cut it","want me a man who speaks gently with a smile and asks me how my day's been and loves dogs more than life itself","fuery can Get It. ))","(( gotta love that Group Crush W/The Squad feel","it ain't easy being the cute friend eh havoc ))","(( SHOUTOUT TO BOTH","AND ALSO","FOR HELPING ME HC FUERY'S PUP AAAAAAAAA","also it's my excuse to make a connie tag ; 3 ; ♥ ))",".TRUE BLUE ( ;concorde blue )","(( a fic i'll never write: Fuery telling dreamy stories about his time down south ))","(( that's the sound of me rolling my eyes. but we almost there ughh ))","(( i love these dumb assholes sfm......... ))","(( will be starting in on memes tonight ! ))","(( aaaAAAAAYYYYY i've needed a new promo for a while ))","pherraified","(( AAAAAAAYYYY THE BOYS ARE BACK IN TOWN ))","(( i mean ryan and shane are just fuery and havoc already but ))","(( daytime reblog ))","(( i haTE THEM SFM HAhahA ha HA A what a good episode ))","(( one last self reblog ))","(( these are the stories kain laughs about between beers ))","(( oh no bredaaa :c ))","(( aaaaaay billie ))","(( aw breda aw gee ;; ♥ ))","(( fuery and riza i s2g","riza supports even his dumb trivial decisions ))","(( team building exercises involve play mahjong w the squad ))","(( I DON'T CLAIM TO UNDERSTAND WHY BUT I LOVE IT ANYWAYS ))","(( i love these goobers ))","(( STAKEOUT SHENANIGANS ! ))","beckywiththegoodaim","(( AAAAY BECCAAAA ♥ ))","(( is fuery actually any better at chess than he was before? who's to say lmao","does he break neutral composure and spend a week studying how to play chess out of pettiness tho? aaaayyy ))","(( p u r e ! ))","(( ??? ))","(( G O O D ))","(( put under a cut bc of length !!! ))","PTSD || ;for t.s","FLASHBACKS || ;for t.s","(( petty is as petty does i suppose ))","(( lmao yes QUESTIONS","just like how it DOESN'T MATTER lmaooo ))","hirayaart","firewoodfigs","(( AW SHUCKS YOU GUYS ♥♥♥","HHHhhhhh just look at hiiimmm !!!!!!!!!!!! ))","(( it's ALWAYS Bully Fuery Hour ))",".( ;dash games )","VILLAIN NAME: /MAD DOG/","SUPERPOWER: /WEREWOLF/","hell yeah","that should be a crime","BUT ALSO THE COLORS?!?!??!?!!?","GOD I WANNA LEARN DIGITAL PAINTING BC THERE IS A RAINBOW IN HIS SKIN AND HIS SHIRT AND IT'S SO REALISTIC AND JFAOISDHGAO;IDJG","dolcetto","(( I HAVE NO IDEA WHY I HEARD ''RUFFRAGE MOVEMENT'' AND DECIDED THEY NEEDED TO BE THE LOCAL CAMPUS ACTIVISTS","BUT ALAS HERE WE ARE??? ))",".HUNT WITH THE HOUNDS ( ;dolcetto )","(( kain is nothing if not awkward and concerned ))","(( kain is nothing if not awkward and concerned for his friends :c ♥ ))","(( falmaaaaaaan ! ))","(( EXCEPT TBT THAT ONE TIME HE WAS ACTUALLY CANONICALLY SPYING ON HAVOC AS PART OF HQ INSPECTIONS........ ))","I wonder what Falman writes about.....","rizahawkeye1380","(( we've never written but omg jovi's a genuine grace to my dash if ur not following their blogs ur doin urself a disservice ))","(( pfhfpsfpsdhfsdf ))","(( HUGHES AND DAD JOKES ALERT ))",".HIS PATIENT PARTNER ( ;gracia hughes )",".OF PHOTOGRAPHS ( ;elysia hughes )","(( falman investigating hughes' murder and formally /requesting/ to be part of Team Mustang to better investigate","is one of the few things i prefer from '03","--cue me crying into Snow's arms about slytherin falman............. ))","there is just this beautiful insert of characterization that i really appreciate in falman leveraging Team Mustang for his own gain","or perhaps even vice versa: ROY acquiring falman for his skills but also bc he worked so closely with hughes- maybe he knew smth","-- cue me crying into Snow's arms bc i'm OBSESSED w slytherin falman and slytherin mustang ))","(( hey guess who's NEVER GONNA SHUT UP about this team E V E R","please i'm begging you just talk Team Mustang with me ))","(( atta /boy/ ))","(( filled with copious and glorious plots/hc's/ships/tropes but nowhere to put them","i'm Dyin scoob ))","(( BWAAAAAAH OH NO OH HAVOC","??? ))","lauffcuer","(( nah friend that was a-ok ! ♥ ))","(( silent petty is his favorite petty ))","(( ooOOoooOO ? ))","(( i have no idea where in the team's timeline this is set","originally it was gonna be the ''havoc's date'' bet but honestly this is probably commonplace enough for any time lmao ))",";)","(( AAAAAAAAAA EASYYYY ♥♥♥ ))","** also if there's any incorrect info please feel free to correct me","i assumed the pocket watch would be a quick identifier but i also realize idk if she'd keep one visible ... ))","(( aaawh ♥ ))","(( first farmer's market of the season","and ny is expecting a RAIN and SNOWSTORM","and it's supposed to start while i'm SITTING OUTSIDE IN AN OPEN TENT FOR HOURS","cool ))","(( tehee go forth and be embarrassed ))","cagair","(( lovesick havoc is my WEAKNESS ))","(( ''why are u scared of me?'' ''put down the knife and i'll tell you'' ))","(( huehuEHUEHUE fuery's the WINK WINK NUDGE NUDGE friend ))","(( blows u a kiss ♥ ))","(( I'MSOIFJSDOI SCREAMING ))",";to be tagged",";dr. knox","(( this is never not just RIDICULOUS ))","(( ME SOBBING????!?!!!","I WILL NEVER NOT TALK ABOUT HUGHES' LIL CHICKY PJ'S................. ))","(( jfoiasdhfois i loVE THIS ALREADY?! ))","sheska","(( GO OFF SHESKAAAAAAAAAA ))","FUCKIT we've gone full iconless now","i roleplayed in chatzy. i remember the days before luxuries like icons","u don't need icons to be an IT Geek and a beautiful country boy","(( hHhGHGHGHHGHGHGHG THERE IS SO MUCH IN HERE THAT JUST MAKES ME WEEP FROM HUGHES TO ROY TO TEAM I CRY ))","(( I'M SOBBING ))",".LUNCH BREAK ( ;memes )","(( kain is a gun bi","i am a baseball bat bi pretending to be a knife bi but who am i foolin...... only myself.............. ))","(( CATCH ME CRYIN IN THE CLUB THAT'S SO SWEET ))","(( RIP and bye fuery ))","(( RIP and bye fuery","radar o'reilly vc: HEY ))","(( is this how arakawa-sensei felt","tbt the Big Booty alchemist and their JIGGY JIGGY ))","tbt the Big Booty alchemist and their JIGGY JIGGY","i'ma ctually revamping an old FMA oc rn. nothing to do w a fidget spinner. but possibly just as goofy ))","(( this drunk ass is nothing if not a Dipshit ))","(( holy shit... ))","(( not even gonna bother to tag a bleghhh doodle","but idk where/when else to upload them so lmao ))","(( tehehe i already have a few ideas ))","(( just reblogging one more time bc i had a couple soft ideas and if i don't write 'em as starters i might just do a ficlet ))","(( if ur wondering if it implies something sexual","not /inherently/. i'm sure it could","i don't really intend it to","i like reading quiet soft moments and don't get to write them too often ))","(( MEH I'LL GO WITH BOTH TEEHEHE ))","(( ''LOyaL cANiNe HOw We sALuTE thEE'' i love these stupid meatballs ))","(( kehehehe ))","FOOD || ;for t.s","(( pfhfhsshsohsiohsoihf i am sorry that this is all LITERALLY just............... rambling ))","(( may not be super active today we'll see; will be eager to respond to all my memes eventually !!! ))","(( i thought i could do my drafts chronologically but i was struck with inspiration and couldn't resist haha ))","(( i am so easy to persuade into a ship i s2g.... pls.... give me shippy shit to draw and harass u with......... ))","revolverhart","** alternately if u don't want me to post ur message just IM me !!!! ))","(( oh u. oh katie. ♥ ))","(( i love jean and kain as a stupid duo both platonically and romantically","i will msg u to further discuss jfsodfjosdf !!!!!!!!!! ♥","oh jean.... don't tease him abt his crush... u will Ruin him......","and oh kain..... don't take it on on jean that u like his stupid face...... just look at him when u talk........... c'; ))","the owlchemist","(( SORRY THIS TOOK EONS; if there's any kind of info that wouldn't fit well / is incorrect please lmk !!! ♥ ))","(( ''maybe it's a WERE-house like a were-WOLF and it needs a full moon to come out'' I S2G............... ))","(( SOFTLY GASPS.................. ♥♥♥♥♥ ))","hyuroiofficial","rebecca catalina","(( SIS REALLY IS OUT THERE PUTTING UP HER BEST GAME","jfaoisdjf i'm just doodlin warmups between commissions but these two entertain me so deeply ))","(( OH !!!!!!!!!!! ♥ ))","(( h a v o c .... ))","(( ??? ))","(( i think we can end it here? unless you wanted to venture into the following morning but honestly i'm good at cutting it lol","either's cool by me ))","(( ;; ♥ ))","(( ur GOT DAMN RIGHT ))","(( NEITHER KAIN NOR I KNOW HER BUT I WANNA so /we aboutta/ ))","she's awkward.... he's awkward.... i'm sure they'll get along heehhe","''hi i'm kain fuery and i promise not to electrocute u on our FIRST meeting","but the second one is fair game''","(( :'( ♥ ))","(( i literally have no recollection of when i started writing books as replies","my other blogs i'm p good at dialogue-only or like a few lines of description","like i know u nerds love reading but if ur daunted by novella replies.... i'm legit so sorry and you NEVER need to match length omg ))","(( top three paragraphs are just exposition feel free to jump down ))","(( jfosidfoisf ))","(( is that middle name subject to change? mm. we'll see.","i like K.C. Fuery......","ughhh we'll see ))","(( jaosdhgdsjffijd ))","(( my first one is.... Full..... i made a second","have at it ! ))","(( fjaosidjfao;sdgj ))","be nice to havoc he's doin his  best tho","(( RIZA... BA B E....... ))","(( now riza has two options:","save his life","or make it absolutely HELL.","??? ))","(( AND WITH THAT I'M OFF FOR THE NIGHT LMAO ))","(( i leave for ONE DAY and y'all start THIRSTING over sergeant puppydog eyes ))","(( wHY IS THIS KAIN................. ))","(( fuckit i'm doing shots and i'm feeling soft at 1 AM ))","(( JFOIASJDFO I DECIDED AGAINST IT AND DELETED THIS REBLOG BUT WHEN I REFRESHED THE PAGE THERE WERE TWO SUBMISSIONS I APOLOGIZE ))","** BACK BY POPULAR DEMAND? ))","(( i just checked the wall for final shits n’ giggles and lo’ and behold i missed a single reply ))","(( severely emetephobic... would prefer if that one wasn't sent but if it /is/ i'll likely only write the aftermath","and probably with very few details. ))","(( RIP fuery ))","(( HEY YOU ))","(( AND NOW I GOTTA SLEEP I MAN THE FARMER'S MARKET TOMORROW'S MORNING SHIFT","BUT I CRY...... TOOK ME LONG ENOUGH............. F I N A L L Y... ))","(( working farmer's market but will be back laterrr ))","(( still at farmer's market","hmu for later !!! ))","(( at market rn ))","(( that was only in the last hour","i got two people sent me shit while at work. who the FUCK just made my entire evening","/CRACKS KNUCKLES/ ))","(( P U P P I E S ))","(( read: technology keeps fuery up at night ))","(( was it hubris... what it chutzpah.....","i will get back to those later there are some REALLY SOLID questions but i am burnt out","and gonna go play monster hunter for a bit ))","i'm still accepting memes but i think i'll cut off ''Have You Ever'' memes for now lol","(( ''post-war addition'' in relation to Fuery lmao not necessarily for everyone","customize to suit your muse ))","(( ''post-war addition'' added in relation to Fuery lmao not necessarily for everyone","(( THANK GOD ))","(( aaaah dumb boys ¯\\_(ツ)_/¯ ))","(( my dog did this to my leg while i was writing this","fuery's heart is so full ))","i call this one ''a sergeant's lament''","(( * I'M ASSUMING THIS FOLLOWS THE ''GHOST STORY'' ANON FROM YESTERDAY LOL? ))","???","(( o m G ))","(( oh hell /yeah/ ))","(( oh hell /yeah/","jovi's entire portrayal is what i like to call","Va Va Voom.","lust is absolutely terrifying; she's mean and i love it; five stars; would reocmmend to a friend ))",".BUDDING PRINCESS ( ;mei chang )",".STEEL WARRIOR ( ;lan fan )","and there's a lot of them !!!!","(( THERE IS LITERALLY NOTHING FUNNIER I CAN ADD SO I HAVE TO SAVE THIS BUT LMFAOOOO ))","(( big headcanon that denny joined the military for the benefits to help support his family","whether that be singlehandedly or otherwise ))","(( d'aaAaaawhhh ))","(( let's try this again in the writing sense lol ))","(( yes. ))","(( mleh i'll give it one more chance while i shower lol ))","(( I'M FJSOIDGHS:OIDFJSIOF I LOVE THIS HAHAHA","IS THAT TRAP AND RADAR?? AWWWH ))","and omg never apologize for note spam ilu","(( OH GEEZ OH GOD OH GEEZ OH GOD I'M GONNA CRY RIGHT HERE AND NOW JFOA;SDIGHAOSIDGHGDFUG","OH MY GOSHHHHHHHH","?????","HOLY MOLY..... I'M EMOTIONAL TYSM FOR THE TAG !!!!!!!!! ))","(( COMPLETELY AU / NON-CANON PLEASE; I JUST WANNA WRITE A PROPER KISSING SCENE IT'S BEEN SO DAMN LONG..... ))","( v; || undetermined. )","(( pre-relationship? post-relationship? who knows who cares they're adorable jfosidjfos ))","(( self reminder i wanted to draw a thing based off this scene jfaoisdghaos;idfj ))","(( P U P P Y D O G. ))","(( PUT IT UNDER READ MORE BECAUSE IT GOT LENGTHY OOPS ))","(( PUT IT UNDER READ MORE BECAUSE IT GOT LENGTHY OOPS","also modified what kind of ''costume party'' it might be ))","(( i'm LIVING for HagaOni omg ))",".( ;games )","HagaOni","(( pffsfgkk ))","(( reblogged at 3 am lmao... ))","(( this is how i talk abt team mustang on any given day ))","(( wave wave waves ))","(( i was gonna write self indulgent hc's today but that didn't happen","so hmu for storytime w kain !","the good. the bad. the ugly. the absolutely obscure bits of his time deployed. probably short snippets. ))","(( ''kain fuery'' and ''raw muscle'' don't usually go in the same sentence but tonight i'll make an exception ))","(( surveyed the area about an hour ago-- there was a small gathering and we don't even know if it'll last as a protest--","so i may be back early or i may be back later. ))","(( thaaaat's right !","it's that time again ! ))","kinghughes","(( jdfojFOIijosdiFOISD OH MY GOSH ))","(( n'aaaawwwh finny ♥ ))",".RADIO SHOWS ( ;misc broadcasts )","(( i think i can do like 3-5 of these today? ))","(( working farmer's market; send memes for later !!! ))","(( oh. ))","(( i'm cracking UP holy smokes ))","(( I THINK DOGS SHOULD VOTE!!!!!!!!!!!!!!!!!!! /I THINK DOGS SHOULD VOTE/!!!!! ))","(( another friend going with sent us info that they're busing in literal busloads of ''professional agitators'' from a few cities over","syracuse protests have been p damn tame but buffalo agitators /will/ make this a bad time if they show ))","(( found out the high schoolers in my own town organized something today so ofc i'll show up show support no excuse not to ! ))","(( me getting buzzed and desperately trying to find creative energy today ))","(( i'd like to say ''i can't believe she inserted the konami code in fuery's dinky lil sticky notes'' but that absolutely sounds like","something arakawa would do ))","i know it's irrational....","not even home was safe?!","nothing is sacred","(( WE S T A N BIRD AND EASY ♥♥♥ ))","(( oh my godddddd ))","(( oh rad !!! ))","(( at market rn; will be doing replies when i get home ! ))","(( STILL EMOTIONAL ABOUT 'EM ))","(( N I C E ))","(( tee hee hee ♥ ))","(( i hope this is okay ! ))","TINNITUS || ;for t.s","(( i know i have at least one follower with a trigger over this condition; tagged just in case ♥ ))",".FINDING ONE'S TONGUE ( ;languages )","(( really like the idea of lineman being one of kain's early jobs as a cadet or corporal. these are not FMA-uniforms by any means tho lol ))","(( lights of my life: birdie and easy !!!!!!!!!!!!! ))","(( RIP poor kain lol ))",";) wink wonk","(( i'm so sorry this took forever i forgot to input my threads into my tracker as i got back into the swing of rp","? ? ?","but YES I'M REAL HYPE FOR KAIN AND NOCTUS TO INTERACT","and yeah i'm sure the distrust might take a bit ;; ♥ ))","(( oH YEAH naturally","hey tell a friend i heard kain fuery is Ripped. absolutely s t a c k e d. ))","creepiitus","(( honestly i'd have said 'mustard' too that's valid kimbs.","but WOO HELLO HELLO i love me one (1) bad man kimblee !!!! ♥","also there's never a wrong time to bully fuery","i'm shark btw it's a pleasure ! ))","(( fjosdijfosjfsdf i hit send early so sorry about that confusion","BUT YEAH good luck @ fuery being cross examined or whatever kimblee's up to fjsodfjsd ))","(( some of these go better with eachother than others","i have a gajillion playlists so i just... shuffled through the three i listen to most? ))","(( idk what he's teasin roy about but sometimes roy deserves to be teased","not quite roasted. more like. a Honey Roast. :') . ))","( v; || humble beginnings. )","(( me banging both hands on the table: pre !! team !! mustang !! ))","(( loYA L CaNinE hOw WE saLuTE ThEe ))","(( ruh roh ))","???????????","(( i'mma be honest anon i have zero idea what you're referring to?? ))","(( jsoidjfosdf wh a t ))","maybe you were looking for lieutenant havoc.","(( oof.... i know i apologized in advance but ))","(( if i recall correctly there's a whole scene here about roy being AWFUL at housework ? ))"]
}