{
    "tags": ["rp blog","ic","rp","open starter","ooc: new blog who dis","fma rp","breda's office hours","rp promo","anime rp","promo","heymans breda","team mustang","rp starter","scentedbygunpowder","To Capture a Chimera","canisfuria","check in calls","oh what the everloving","goddammit guys","these are not the state secrets I want to know","rp meme","rp memes","symbol meme","symbol starter","happy global game jam!","hahaha","this is stupid","theburiedbookworm","there's no crying in alchemy","this counts as touching","don't tell the guys","Rp","alchemic-elric","I'm doing this on mobile I hope these tags work","office bets","thesmokingknight","((howdy!))","shogi boys","((muse is much better at chess than mun))","((please do not actually send me chess moves))","Ooc","fma","fma brotherhood","digital doodle","fanart","tv doodle","ooc","asks","anon","team strategist","extra credit","never send a man to do a dog's job","mustang owes me half a sandwich","rose beer sounds terrible ngl","((no. no it doesn't))","friigidus","((pls don't kill him))","((the only thing men have collectively is the audacity AFJDF:JSDKd :SO GOOD))","breda answers","faults meme","((I don't really care for Heinlein but))","((I can HEAR Breda saying this))","mustang's gonna absolutely incinerate me","tw injury","cw injury","cw blood","tw blood","((I never know how to do content warnings but this one felt like it needed something))","((inspired by the testimony of Portland MAX stabbing victim Micah Fletcher))","burningflamesofhell","fmab rp","((ask me how work was today I dare you))","cw language","((it's a very good book!!))","((hahaha rip mustang))","((I'm glad you appreciated the 'real girl' moment))","((I bet he's slipped up and said it out loud before and gotten utterly destroyed))","((in fact feel free to go ahead and write that lolol))","actualflamealchemist","((herp derp posted from wrong blog originally))","((I dunno is this anything?))","((poor Sheska))","((I hope he didn't hit her))","loyalestdoginthemilitary","((sorry for all the swears))","((it's the adrenaline talking))","((diiid I accidentally post this to the wrong blog at first yes I did))","((I am good with computers))","reply hazy try again later","this is fine","((lolol))","((every resume is bad))","((he'll figure it out just give him a minute))","((sorry I wrote a whole ass novel))","((beware the MENACING TAIL WAG))","((Havoc is MVP NPC))","((omg adorable))","((wafflefries ooc))","((wafflefries worried))","((btw hashtag is now pronounced wafflefries))","fluff friday","((weird for this character? maybe but here we are))","official-emma-hawkeye","((too soon?))","((I'm going for 'cathartic' here))","let's rotate the board! (Breda transferred to Briggs)","((wait does Amestris have bakfietsen? cuz that would be perfect))","((speak is too generous but he can read a newspaper in Drachman and Aerugan))","or is it","((drugs are bad kids))","((this was really fun to think through!))","four donuts remain","Has that damn dog been in here","((oh hello))","Dmitri Sobakin","((thank you for eating my donut))","((I loled))","((aaand scene))","((I loved every part of this thread))","((except where Hayate was sad T_T))","((I hope someone cheers him up soon))","((omg))","((I didn't))","((I mean he didn't))","((it didn't even occur to him))","((ooh go dig up that DIRT))","((I do think this is after the other thread))","((so he's frustrated that this is still an issue))","((also kinda drunk))","((so))","((gl))","gonna find her XO and have some WORDS","((well this took forever I'm very sorry))","indomitableicequeen","((I don't know what to tag this exactly))","((but send me something! send me lots of things!))","((rescue me from endlessly refreshing the news))","ask me about my AUs","flame alchemist riza au","tw covid 19","munday","apology donut","((there may only be one donut shop still in operation around here))","((gotta support em))","mariasuzanne","((this is great!))","((and for real no worries))","((there's a legit apocalypse going on out there))","((the pandemic has also turned my brain to oatmeal))","((genuinely curious))","((if you think I'm missing an opportunity I'd love to hear it))","((uh oh secret's out))","((I hope that's ok!))","((if you don't like it we can just pretend this never happened))","((oh yeah skip the boring parts let's hang out on this ROOF))","((Imma come back and ask stuff off everyone who posted this after work!))","((if this posted like 6 times I apologize))","((hoo boy NOT NOW HAYATE))","wow gettin awfully philosophical for a monday","omg TUMBLR FIX YOUR LINE BREAKS","but it's not even Bad Decision Thursday yet!","thefullmetaledwardelric","that sounds like a natural end to the scene","let's call it there","but start a new one anytime inspiration strikes!","are you kidding?","after she just told him about a lifetime of men violating her bodily autonomy?","he's never going to shake her HAND again without permission","((somehow I don't think Ed is enjoying this as much as Breda is))","((aaaaah your last bit was so good!))","potato-grade brain","I started today so well too","Actually wrote decent code today","but then cross-browser compatibility issues broke me","You could HEAR the sound of my spirit leaving my body","ANYWAY","I appreciate you","adulting","bad decision thursday","I can't believe I forgot about this thread","TELL TELL TELL","bahaha","((ok it was very hard to choose between those symbols))","((but I'm a huge language nerd))","((and by huge I mean I have a whole ass degree))","((anyway I think this is pre-diaspora))","oh this is fun","two truths and a lie","dap-brown","nope","I mean think about how he was ready to straight up execute Ross if need be","he's been called on to do some STUFF","((Sorry!!))","((he would have yelled at anyone))","et tu hawkeye","((I realize I may be giving off 'no bye' energy today))","((I hope y'all don't feel like I'm shutting you down))","((it's just that once I decided he was having a bad day I had to keep going))","((and the asks just KEPT COMING))","((I wish I could hear that phone call tho!))","((so what if I already have more open threads than I can handle))","((I'LL TELL YOU WHEN I'VE HAD ENOUGH))","I should spend tonight cramming","but I probably won't!","((breda is so over every part of this day lmao))","((excuse me who is out there drinking pink lemonade with tequila is that a thing))","((also collecting bones?? COLLECTING BONES WTF))","donuts","ic? ooc? who's to say","use it as a starter if it sparks joy","bad bit moment","dude that happened ONE TIME ((about))","((character trait: dangerous escalation of prank wars))","cw covid19","the mission","the motivation","anon asks","((no dogs were harmed in the making of this post))","eat trash write trash live forever","((amestris has carnitas don't try to tell me otherwise))","((ugh he's so nice))","((not even a little tempted to bang around the office slamming all the doors))","((unlike a certain second lieutenant))","((that one panel))","((told me so much about this character))","((I mean the phrase 'foundational to my portrayal' sounds so unbelievably pretentious but))","((well crud I went ahead and used it anyway didn't I))","((listen I know I SAID I was going to bed early))","((I tried))","((I don't know how))","Rp meme","bad decision Thursday","((the project is extremely on brand))","((the brand is 'technically it's a larp but wait hear me out'))","starter meme","zero chill","((is that the thread name or my response to seeing it pop))","((this feels like the end to me yeah?))","((<3 Riza's last paragraph so much))","((I'm so bad at secrets))","((it occurs to me that I have no idea what Riza's apt looks like lol))","((and while I COULD ask you))","((yolo))","((aagh sorry this took so long))","((thank you for indulging me with this thread I am having the time of my life over here))","((awk))","((ward))","((I'm picturing not in uniform fyi))","havoc npc","((... I have literally 7 patrons))","((I'll be back as soon as I hit that auth wall don't worry))","((I'm dying of secondhand embarrassment))","((oh it's terrible))","((I love it))","((QUESTIONS are raised lmaoooo))","((ok when I said 'one more' I didn't realize it was going to be so short but))","((count it))","((I hardly ever drink))","((but today was hoo boy))","((my whole team would be together at the bar right now if it were legal))","((so I've had like thismuch and I'm already like woooo))","((this is fine))","((thank you both for this gift))","((presumably the 'leaning on' is being helped out of the building))","((next up: I assumed Sheska but talk amongst yourselves))","alex armstrong npc","((ok but actually? Tysm!)) ((That's so nice!))","shortemprd","((it totally ate your ask))","((I clicked save as draft and it disappeared into the ether))","((so that was weird))","((anyway hello!))","((it's the weekend PILE it ON))","((you ever ask a guy his favorite color and he just looks PERPLEXED?))","((Like what are you gonna ask me my favorite cardinal direction next))","((Yeah I really can't get enough of ENE))","((What are you even TALKING about))","dash games","wall","post promised day","talk to transformer","sentence starters","((that's kilos btw))","((cuz Europe analogue))","((I wanna play toooooooo))","have you ever","dash commentary","((yes I am aware this is literally two sentences))","lauffcuer","((yeah I know I SAID I was going to bed))","((but as soon as I laid down I got this idea))","((we haven't actually done this one yet right??))","((lol))","((ask me about my keyboards))","((...if you dare))","((slaps chess clock))","((your move Brzęczyszczykiewicz))","((honestly a little surprised none of these are the Wii Shop Channel music))","pre-team-mustang","roleplay starter","roleplay meme","rp starters","rp prompts","pls reblog I spent way too long on this dumb thing","rp: that time Olivier saw me naked","rp: that time I told Fuery about double ghosts","rp: one of the first times I met Fuery","rp: that time I saved Sheska from those assholes","rp: that time Riza didn't want to go to the hospital","rp: that time I tried to sleep in the supply closet","rp: that time Fuery got sparkled on","rp: that time I first saw Sheska's apartment","rp: that time Fuery fell asleep on me","rp: that time Fuery wouldn't admit to being tired","rp: that time I kissed Riza (don't tell her)","rp: that time I kissed Fuery (listen I can explain)","rp: that time I kissed Olivier","rp: that time I fell down a ravine","rp: that time Mustang was tired","rp: that time Sheska got angry","rp: that time Fuery got wasted","rp: that time Olivier asked me how much I weighed","rp: that time I burned my hand","rp: that time we celebrated the train station opening","rp: that time Emma pinned a guy to the wall","rp: that time the dog woke me up","rp: that time I made a bad call","rp: that time we watched the kids play in Ishval","rp: that time Ed broke his leg","rp: that time Fuery was a spy","rp: that time there was an earthquake","rp: that time Ed became a man","rp: that time Sheska stayed late","rp: that time Riza caught me on a date","rp: that time I Worchestershire","rp: that time I got high in hospital","rp: that time I met Olivier","rp: that time I was so unbelievably hungover","rp: that time I dropped my gun in front of Olivier","rp: that time Riza made me play 2 truths and a lie","rp: that time I nicknamed Ed Ole Armsword","rp: that time Riza fell asleep on me","rp: that time I talked about being scared","rp: that time I learned about Riza's tattoo","rp: that time I patched Fuery's wound","rp: that time I complained to Riza about the dog","rp: that time Fuery swore he wasn't drunk"]
}